const writing = {
  label: 'எழுத்து',
  id: 'writing',
  img: 'writing',
  list: [
    {
      id: 'vowels-writing',
      type: 'tracing',
      label: 'உயிர் எழுத்துக்கள்',
      data: {
        type: 'tamilVowels'
      }
    },
    {
      id: 'consonants-writing',
      type: 'tracing',
      label: 'உயிர்-மெய்-எழுத்துக்கள்',
      data: {
        type: 'tamilConsonants'
      }
    },
    {
      id: 'match',
      type: 'match',
      label: 'உயிர் மெய்: பொருத்துக',
      commonData: {
        big: true,
        title: 'உயிர் மெய்: பொருத்துக'
      },
      data: [
        `க் + அ , க 
க் + ஆ , கா 
க் + இ , கி 
க் + ஈ , கீ 
க் + உ , கு 
க் + ஊ , கூ `,

        `க் + எ , கெ
க் + ஏ , கே
க் + ஐ , கை
க் + ஒ , கொ
க் +  ஓ, கோ
க் + ஔ, கௌ`,

        `ச் + அ , ச
ச் + ஆ , சா
ச் + இ , சி
ச் + ஈ , சீ
ச் + உ , சு
ச் + ஊ , சூ  `,

        `ச் + எ , செ
ச் + ஏ , சே
ச் + ஐ , சை
ச் + ஒ , சொ
ச் +  ஓ, சோ
ச் + ஔ, சௌ`,

        `த்  + அ , த
த் + ஆ , தா
த் + இ , தி
த் + ஈ , தீ
த் + உ , து
த் + ஊ , தூ`,

        `த் + எ , தெ
த் + ஏ , தே
த் + ஐ , தை
த் + ஒ , தொ
த் +  ஓ, தோ
த் + ஔ, தௌ`,

        `ப்  + அ , ப
ப் + ஆ , பா
ப் + இ , பி
ப் + ஈ , பீ
ப் + உ , பு
ப் + ஊ , பூ `,

        `ப் + எ , பெ
ப் + ஏ , பே
ப் + ஐ , பை
ப் + ஒ , பொ
ப் +  ஓ, போ
ப் + ஔ, பௌ`,

        `ம் + அ , ம
ம் + ஆ , மா
ம் + இ , மி
ம் + ஈ , மீ
ம் + உ , மு
ம் + ஊ , மூ`,

        `ம் + எ , மெ
ம் + ஏ , மே
ம் + ஐ , மை
ம் + ஒ , மொ
ம் +  ஓ, மோ
ம் + ஔ, மௌ`,

        `ர் + அ , ர 
ர் + ஆ , ரா
ர் + இ , ரி
ர் + ஈ , ரீ
ர் + உ , ரு
ர் + ஊ , ரூ `,

        `ர் + எ , ரெ
ர் + ஏ , ரே
ர் + ஐ , ரை
ர் + ஒ , ரொ
ர் +  ஓ, ரோ
ர் + ஔ, ரௌ`,

        `ல் + அ , ல 
ல் + ஆ , லா
ல் + இ , லி 
ல் + ஈ , லீ
ல் + உ , லு
ல் + ஊ , லூ`,

        `ல் + எ , லெ 
ல் + ஏ , லே
ல் + ஐ , லை
ல் + ஒ , லொ
ல் +  ஓ, லோ
ல் + ஔ, லௌ `,

        `வ் + அ , வ
வ் + ஆ , வா
வ் + இ , வி
வ் + ஈ , வீ
வ் + உ , வு
வ் + ஊ , வூ`,

        `வ் + எ , வெ
வ் + ஏ , வே
வ் + ஐ , வை
வ் + ஒ , வொ
வ் +  ஓ, வோ
வ் + ஔ, வௌ`,

        `ழ் + அ , ழ
ழ் + ஆ , ழா
ழ் + இ , ழி
ழ் + ஈ , ழீ
ழ் + உ , ழு
ழ் + ஊ , ழூ`,

        `ழ் + எ , ழெ
ழ் + ஏ , ழே
ழ் + ஐ , ழை
ழ் + ஒ , ழொ
ழ் +  ஓ, ழோ
ழ் + ஔ, ழௌ`
      ]
    },
    {
      type: 'rightOne',
      label: 'எழுத்துக்களை அடையாளம் காண்க',
      id: 'sound-vowels',
      data: {
        title: 'ஓசை கேட்டு எழுத்துக்களை அடையாளம் காண்க.',
        type: 'letters',
        collectionType: 'tamilVowels'
      }
    },
    {
      type: 'rightOne',
      label: 'எழுத்துக்களை அடையாளம் காண்க - 2',
      id: 'sound-consonants',
      data: {
        title: 'ஓசை கேட்டு எழுத்துக்களை அடையாளம் காண்க.',
        type: 'letters',
        collectionType: 'tamilConsonants'
      }
    },
    {
      id: '1200',
      label: 'மெய் எழுத்துக்கள் ',
      type: 'group',
      slug: 'group',
      data: {
        editable: true,
        title: 'மெய் எழுத்துக்கள் ',
        types: [
          {
            name: 'உயிர் எழுத்துக்கள் ',
            text: 'அ, ஆ, இ, ஈ, உ, ஊ, எ, ஏ, ஐ, ஒ, ஓ, ஔ'
          },
          {
            name: 'மெய் எழுத்துக்கள்',
            text:
              'க், ங், ச், ஞ், ட், ண், த், ந், ப், ம், ய், ர், ல், வ், ழ், ள், ற், ன்'
          }
        ]
      }
    },
    {
      id: '1100',
      type: 'tracing',
      label: 'கி வரிசை : எழுதி பழகுக',
      data: {
        repeatCount: 1,
        type: 'tamilOthers',
        chars: [
          'கி',
          'சி',
          'டி',
          'ணி',
          'தி',
          'நி',
          'பி',
          'மி',
          'யி',
          'ரி',
          'லி',
          'வி',
          'ழி',
          'ளி',
          'றி',
          'னி'
        ]
      }
    },
    {
      id: '100',
      type: 'tracing',
      label: 'கீ வரிசை : எழுதி பழகுக ',
      data: {
        repeatCount: 1,
        type: 'tamilOthers',
        chars: [
          'கீ',
          'சீ',
          'டீ',
          'ணீ',
          'தீ',
          'நீ',
          'பீ',
          'மீ',
          'யீ',
          'ரீ',
          'லீ',
          'வீ',
          'ழீ',
          'ளீ',
          'றீ',
          'னீ'
        ]
      }
    },
    {
      id: '1300',
      type: 'tracing',
      label: 'கு வரிசை : எழுதி பழகுக ',
      data: {
        repeatCount: 1,
        type: 'tamilOthers',
        chars: [
          'கு',
          'சு',
          'டு',
          'ணு',
          'து',
          'நு',
          'பு',
          'மு',
          'யு',
          'ரு',
          'லு',
          'வு',
          'ழு',
          'ளு',
          'று',
          'னு'
        ]
      }
    },
    {
      id: '200',
      type: 'tracing',
      label: 'கூ வரிசை : எழுதி பழகுக ',
      data: {
        repeatCount: 1,
        type: 'tamilOthers',
        chars: [
          'கூ',
          'சூ',
          'டூ',
          'ணூ',
          'தூ',
          'நூ',
          'பூ',
          'மூ',
          'யூ',
          'ரூ',
          'லூ',
          'வூ',
          'ழூ',
          'ளூ',
          'றூ',
          'னூ'
        ]
      }
    }
  ]
};

export default writing;
